dofile('../luaScripts/risk/RCUtils.lua')

local function getCon(mysql_conf)
    local res = string.gmatch(mysql_conf, "([^,]+),")
    local ip = res()
    local port = tonumber(res())
    local db = res()
    local user = res()
    local passwd = res()
    local driver = require "luasql.mysql"
    local env = driver.mysql()
    local con = env:connect(db, user, passwd, ip, port)
    return con
end

juyuan_lua_categories = {
    
    [21001] = {
        key = "聚源-债券评级",
        field = "todo",
        types = {
            [21001] = { "AAA+", 1000 },
            [21002] = { "AAA-", 990 },
            [21003] = { "AA+", 980 },
            [21004] = { "AA", 970 },
            [21005] = { "AA-", 960 },
            [21006] = { "A+", 950 },
            [21007] = { "A", 940 },
            [21008] = { "A-", 930 },
            [21009] = { "BBB+", 899 },
            [21010] = { "BBB", 895 },
            [21011] = { "BBB-", 891 },
            [21012] = { "BB+", 880 },
            [21013] = { "BB", 870 },
            [21014] = { "BB-", 860 },
            [21015] = { "B+", 850 },
            [21016] = { "B", 840 },
            [21017] = { "B-", 830 },
            [21018] = { "CCC", 799 },
            [21019] = { "CC", 770 },
            [21020] = { "D", 740 },
            [21021] = { "A-1+", 99 },
            [21022] = { "A-1", 95 },
            [21023] = { "A-1-", 90 },
            [21024] = { "A-2", 85 },
            [21025] = { "A-3", 75 },
            [21026] = { "C", 55 },
        },
    },

    [21101] = {
        key = "聚源-债券性质",
        field = "bondNature",
        types = {
            [21101] = { "企业债券", 1 },
            [21102] = { "金融债券", 2 },
            [21103] = { "金融次级债", 3 },
            [21104] = { "国债现货", 4 },
            [21105] = { "央行票据", 5 },
            [21106] = { "短期融资券", 6 },
            [21107] = { "MBS(房贷支持)", 7 },
            [21108] = { "ABS(其他支持)", 8 },
            [21109] = { "混合资本债券", 9 },
            [21110] = { "可转换债券", 10 },
            [21111] = { "国库现金管理", 11 },
            [21112] = { "资产证券化", 12 },
            [21113] = { "公司债券", 13 },
            [21114] = { "中期票据", 14 },
            [21115] = { "转债分离公司债", 15 },
            [21116] = { "地方政府债券", 16 },
            [21117] = { "中小企业集合票据", 17 },
            [21118] = { "集合债券", 18 },
            [21119] = { "超短期融资券", 19 },
            [21120] = { "非公开定向债券融资工具", 20 },
            [21121] = { "次级定期债务", 21 },
            [21122] = { "中小企业区域集优票据", 22 },
            [21123] = { "政府支持债券", 23 },
            [21124] = { "中小企业私募债券", 24 },
            [21125] = { "资产支持票据", 25 },
            [21126] = { "小微企业扶持债券", 26 },
            [21127] = { "二级资本债券", 27 },
            [21128] = { "中小企业可交换私募债", 28 },
            [21129] = { "可交换公司债券", 29 },
            [21130] = { "同业存单", 30 },
            [21131] = { "区域集优中期票据", 31 },
            [21132] = { "项目收益票据", 32 },
        },
    },

    [21201] = {
        key = "聚源-债券分类(级别1)",
        field = "bondType1",
        types = {
            [21201] = { "国债", 1000 },
            [21202] = { "央行票据", 1100 },
            [21203] = { "政策性银行债", 1200 },
            [21204] = { "商业银行债", 1300 },
            [21205] = { "证券公司债", 1400 },
            [21206] = { "其他金融机构债", 1500 },
            [21207] = { "企业债", 1600 },
            [21208] = { "公司债", 1700 },
            [21209] = { "中期票据", 1800 },
            [21210] = { "短期融资券", 1900 },
            [21211] = { "资产支持证券", 2000 },
            [21212] = { "国际机构债券", 2100 },
            [21213] = { "可转债", 2200 },
            [21214] = { "分离交易可转债", 2300 },
            [21215] = { "地方政府债券", 2400 },
            [21216] = { "中小企业集合票据", 2500 },
            [21217] = { "集合债券", 2600 },
            [21218] = { "次级定期债务", 2700 },
            [21219] = { "中小企业私募债券", 2800 },
            [21220] = { "非公开定向债务融资工具", 2900 },
            [21221] = { "其他", 9900 },
        },
    },

    [21301] = {
        key = "聚源-债券分类(级别2)",
        field = "bondType2",
        types = {
            [21301] = { "记账式国债", 1001 },
            [21302] = { "凭证式国债", 1002 },
            [21303] = { "储蓄国债", 1003 },
            [21304] = { "其他国债", 1004 },
            [21305] = { "央行票据", 1100 },
            [21306] = { "国家开发银行", 1201 },
            [21307] = { "中国进出口银行", 1202 },
            [21308] = { "中国农业发展银行", 1203 },
            [21309] = { "商业银行普通债", 1301 },
            [21310] = { "混合资本债", 1302 },
            [21311] = { "商业银行次级债", 1303 },
            [21312] = { "证券公司债", 1400 },
            [21313] = { "其他金融机构债", 1500 },
            [21314] = { "企业债", 1600 },
            [21315] = { "政府支持债券", 1601 },
            [21316] = { "公司债", 1700 },
            [21317] = { "中期票据", 1800 },
            [21318] = { "企业短期融资券", 1901 },
            [21319] = { "证券公司短期融资券", 1902 },
            [21320] = { "超短期融资券", 1903 },
            [21321] = { "住房抵押资产支持证券(MBS)", 2001 },
            [21322] = { "券商资产支持证券", 2002 },
            [21323] = { "其他资产支持证券", 2003 },
            [21324] = { "资产支持票据", 2004 },
            [21325] = { "汽车抵押贷款支持证券", 2005 },
            [21326] = { "信贷资产支持证券", 2006 },
            [21327] = { "国际机构债券", 2100 },
            [21328] = { "可转债", 2200 },
            [21329] = { "分离交易可转债", 2300 },
            [21330] = { "地方政府债券", 2400 },
            [21331] = { "中小企业集合票据", 2500 },
            [21332] = { "中小企业区域集优票据", 2501 },
            [21333] = { "集合债券", 2600 },
            [21334] = { "次期定期债务", 2700 },
            [21335] = { "中小企私募债券", 2800 },
            [21336] = { "非公开定向债务融资工具", 2900 },
            [21337] = { "其他", 9900 },
        },
    },
    
    [21401] = {
        key = "聚源-债券发行的证券市场",
        field = "stockMarket",
        types = {
            [21401] = { "深圳证券交易所", 90 },
            [21402] = { "上海证券交易所", 83 },
            [21403] = { "柜台交易市场", 71 },
            [21404] = { "银行间债券市场", 89 },
            [21405] = { "一级市场", 73 },
            [21406] = { "其他市场", 84 },            
        },
    },

    [21501] = {
        key = "聚源-证券风险评级",
        field = "starRank",
        types = {
            [21501] = { "评级为一星级的证券", 1 },
            [21502] = { "评级为二星级的证券", 2 },
            [21503] = { "评级为三星级的证券", 3 },
            [21504] = { "评级为四星级的证券", 4 },
            [21505] = { "评级为五星级的证券", 5 },
            [21506] = { "评级为六星级的证券", 6 },
            [21507] = { "无风险评级的证券", 99 },
        },
    },

    [21601] = {
        key = "聚源-证券类别",
        field = "stockCategory_id",
        types = {
            [21601] = { "A股", 1 },
            [21602] = { "B股", 2 },
            [21603] = { "H股", 3 },
            [21604] = { "大盘", 4 },
            [21605] = { "国债回购", 5 },
            [21606] = { "国债现货", 6 },
            [21607] = { "金融债券", 7 },
            [21608] = { "开放式基金", 8 },
            [21609] = { "可转换债券", 9 },
            [21610] = { "其他", 10 },
            [21611] = { "企业债券", 11 },
            [21612] = { "企业债券回购", 12 },
            [21613] = { "投资基金", 13 },
            [21614] = { "央行票据", 14 },
            [21615] = { "深市代理沪市股票", 15 },
            [21616] = { "沪市代理深市股票", 16 },
            [21617] = { "资产支持证券", 17 },
            [21618] = { "资产证券化产品", 18 },
            [21619] = { "买断式回购", 19 },
            [21620] = { "衍生权证", 20 },
            [21621] = { "股本权证", 21 },
            --[21622] = { "股指期货", 22 },   --与聚源相关的分类，在我们系统里暂时不处理期货的
            [21623] = { "商业银行定期存款", 23 },
            [21624] = { "其他股票", 24 },
            [21625] = { "牛熊证", 25 },
            [21626] = { "收益增长线", 26 },
            [21627] = { "新质押式回购", 27 },
            [21628] = { "地方政府债", 28 },
            [21629] = { "可交换公司债", 29 },
            [21630] = { "拆借", 30 },
            [21631] = { "信用风险缓释凭证", 31 },
            [21632] = { "浮息债计息基准利率", 32 },
            [21633] = { "定期存款凭证", 33 },
            [21634] = { "个股期权", 34 },
            --[21635] = { "港股", 51 },
            [21636] = { "合订证券", 52 },
            [21637] = { "红筹股", 53 },
            [21638] = { "优先股", 55 },
            [21639] = { "信托基金", 61 },
            [21640] = { "ETF基金", 62 },
            [21641] = { "参与证书", 63 },
            [21642] = { "债务证券", 65 },
            [21643] = { "基金票据", 66 },
            --[21644] = { "美国证券(交易试验计划)", 69 },
            [21645] = { "普通预托证券", 71 },
            [21646] = { "优先预托证券", 72 },
            [21647] = { "股票", 73 },
            [21648] = { "普通股", 74 },
            --[21649] = { "美国存托股票(ADS)", 75 },
        },
    },

    [21701] = {
        key = "聚源-证券市场板块",
        field = "listedSector",
        types = {
            [21701] = { "主板", 1 },
            [21702] = { "中小企业板块", 2 },
            [21703] = { "三板", 3 },
            [21704] = { "其他", 4 },
            [21705] = { "大宗交易板块", 5 },
            [21706] = { "创业板", 6 },
            --[21707] = { "纳斯达克全球精选市场(NASDAQ)", 101 },
            --[21708] = { "纳斯达克全球市场(NASDAQ)", 102 },
            --[21709] = { "纳斯达克资本市场(NASDAQ)", 103 },
        },
    },

    --[21801] = {
    --    key = "聚源-证券上市状态",
    --    field = "listedState",
    --    types = {
            --[21801] = { "上市", 1 },
            --[21802] = { "暂停", 3 },
            --[21803] = { "终止", 5 },
            --[21804] = { "其他", 7 },
            --[21805] = { "交易", 10 },
            --[21806] = { "停牌", 11 },
            --[21807] = { "摘牌", 12 },
    --    },
    --},

    --[[     指数暂时不需要
    [21901] = {
        key = "聚源-证券指数类别",
        field = "indexType",
        types = {
            [21901] = { "综合类指数", 10 },
            [21902] = { "成份类指数", 20 },
            [21903] = { "行业类指数", 30 },
            [21904] = { "地区类指数", 40 },
            [21905] = { "重点类指数", 41 },
            [21906] = { "策略类指数", 42 },
            [21907] = { "风格类指数", 43 },
            [21908] = { "主题类指数", 44 },
            [21909] = { "基金类指数", 45 },
            [21910] = { "债券类指数", 46 },
            [21911] = { "规模类指数", 47 },
            [21912] = { "海外类指数", 48 },
            [21913] = { "客户定制类指数", 49 },
            [21914] = { "期货类指数", 50 },
            [21915] = { "基准类指数", 51 },
            [21916] = { "特征类指数", 52 },
            [21917] = { "表现类指数", 53 },
            [21918] = { "一级行业指数", 54 },
            [21919] = { "二级行业指数", 55 },
            [21920] = { "市场类指数", 56 },
            [21921] = { "其他类指数", 57 },
            [21922] = { "成份指数", 101000 },
            [21923] = { "综合指数", 101100 },
            [21924] = { "行业指数:上证行业指数", 101201 },
            [21925] = { "行业指数:上证380行业指数", 101202 },
            [21926] = { "行业指数:沪深300行业指数", 111101 },
            [21927] = { "行业指数:中证行业指数", 111102 },
            [21928] = { "行业指数:中证全指行业指数", 111103 },
            [21929] = { "行业指数:中证SAC行业指数", 111104 },
            [21930] = { "策略指数", 101300 },
            [21931] = { "上证风格指数", 101400 },
            [21932] = { "上证主题指数", 101500 },
            [21933] = { "上证基金指数", 101600 },
            [21934] = { "上证债券指数", 101700 },
            [21935] = { "上证定制指数", 101800 },
            [21936] = { "中证规模指数", 111000 },
            [21937] = { "沪深300一级行业指数", 111105 },
            [21938] = { "沪深300二级行业指数", 111106 },
            [21939] = { "沪深300三级行业指数", 111107 },
            [21940] = { "中证风格指数", 111200 },
            [21941] = { "中证主题指数", 111300 },
            [21942] = { "中证策略指数", 111400 },
            [21943] = { "中证海外指数", 111500 },
            [21944] = { "中证基金指数", 111600 },
            [21945] = { "中证债券指数", 111700 },
            [21946] = { "中证客户定制类指数", 111800 },
            [21947] = { "中证期货指数", 111900 },
            [21948] = { "申万300子行业", 121000 },
            [21949] = { "申万一级行业", 121101 },
            [21950] = { "申万二级行业", 121102 },
            [21951] = { "申万三级行业", 121103 },
            [21952] = { "非发布指数:申万", 121201 },
            [21953] = { "非发布指数:IMP", 121202 },
            [21954] = { "申万量化策略", 121300 },
            [21955] = { "申万50", 121400 },
            [21956] = { "申万指数", 121500 },
            [21957] = { "申万特征指数", 121600 },
            [21958] = { "宽基/规模指数", 131000 },
            [21959] = { "风格指数", 131100 },
            [21960] = { "主题指数", 131200 },
            [21961] = { "行业指数", 131300 },
            [21962] = { "策略指数", 131400 },
            [21963] = { "区域指数", 131500 },
            [21964] = { "市场指数", 131600 },
            [21965] = { "其他指数", 131700 },
            [21966] = { "定制指数", 131800 },
            [21967] = { "天相基准指数", 141000 },
            [21968] = { "天相风格指数", 141100 },
            [21969] = { "天相特征指数", 141200 },
            [21970] = { "天相表现指数", 141300 },
            [21971] = { "天相一级行业指数", 141401 },
            [21972] = { "天相二级行业指数", 141402 },
            [21973] = { "天相地区指数", 141500 },
            [21974] = { "成份股指数:宽基/规模指数", 151001 },
            [21975] = { "成份股指数:风格指数", 151002 },
            [21976] = { "成份股指数:主题指数", 151003 },
            [21977] = { "成份股指数:行业指数", 151004 },
            [21978] = { "成份股指数:策略指数", 151005 },
            [21979] = { "综合指数:市场指数", 151101 },
            [21980] = { "综合指数:行业指数", 151102 },
            [21981] = { "综合指数:其他", 151103 },
            [21982] = { "中信一级行业指数", 161001 },
            [21983] = { "中信二级行业指数", 161002 },
            [21984] = { "中信三级行业指数", 161003 },
        },
    },
    ]]--

    [22001] = {
        key = "聚源-基金投资风格",
        field = "investStyle",
        types = {
            [22001] = { "股票型", 1 },
            [22002] = { "指数型", 2 },
            [22003] = { "配置型", 3 },
            [22004] = { "现金型", 4 },
            [22005] = { "激进债券型", 5 },
            [22006] = { "债券型", 6 },
            [22007] = { "普通债券型", 7 },
            [22008] = { "短期债券型", 8 },
            [22009] = { "保本型", 9 },
            [22010] = { "激进配置型", 10 },
            [22011] = { "保守混合型", 11 },
            [22012] = { "偏股型", 12 },
            [22013] = { "偏债型", 13 },
            [22014] = { "中短债型", 14 },
            [22015] = { "特殊策略型", 15 },
            [22016] = { "标准混合型", 16 },
            [22017] = { "QDII", 17 },
            [22018] = { "封闭式基金", 20 },
            [22019] = { "大规模封闭式基金", 21 },
            [22020] = { "小规模封闭式基金", 22 },
            [22021] = { "股票型基金(封闭)", 23 },
            [22022] = { "标准混合型基金(封闭)", 24 },
            [22023] = { "激进债券型基金(封闭)", 25 },
            [22024] = { "普通债券型基金(封闭)", 26 },
            [22025] = { "激进配置型基金(封闭)", 27 },
            [22026] = { "其它(封闭)", 29 },
            [22027] = { "亚太区不包括日本股票", 30 },
            [22028] = { "大中华区股票", 31 },
            [22029] = { "新兴市场股票", 32 },
            [22030] = { "环球股票", 33 },
            [22031] = { "行业股票", 34 },
            [22032] = { "美国股票", 35 },
            [22033] = { "环球股债混合", 36 },
            [22034] = { "环球债券", 37 },
            [22035] = { "商品", 38 },
            [22036] = { "可转债型", 39 },
            [22037] = { "纯债型", 40 },
            [22038] = { "纯债型(封闭)", 41 },
            [22039] = { "混合型", 42 },
            [22040] = { "混合型(封闭)", 43 },
            [22041] = { "可转债型(封闭)", 44 },
            [22042] = { "债券型(封闭)", 45 },
            [22043] = { "股票型(QDII)", 46 },
            [22044] = { "混合型(QDII)", 47 },
            [22045] = { "债券型(QDII)", 48 },
            [22046] = { "保守混合型(封闭)", 49 },
            [22047] = { "商品基金(QDII)", 50 },
            [22048] = { "货币型", 51 },
            [22049] = { "短债基金(封闭)", 52 },
            [22050] = { "其它型", 99 },
        },
    },

    [22101] = {
        key = "聚源-基金分类",
        field = "fundStyle",
        types = {
            [22101] = { "股票型", 1101 },
            [22102] = { "混合型", 1103 },
            [22103] = { "债券型", 1105 },
            [22104] = { "保本型", 1107 },
            [22105] = { "货币型", 1109 },
            [22106] = { "QDII", 1110 },
            [22107] = { "其他型", 1199 },
        },
    },

    [22201] = {
        key = "聚源-基金投资类型",
        field = "investmentType",
        types = {
            [22201] = { "成长型:积极成长型", 1 },
            [22202] = { "成长型:稳健成长型", 2 },
            [22203] = { "成长型:中小型企业成长型", 3 },
            [22204] = { "平衡型", 4 },
            [22205] = { "资产重组型", 5 },
            [22206] = { "科技型", 6 },
            [22207] = { "指数型", 7 },
            [22208] = { "优化指数型", 8 },
            [22209] = { "价值型", 9 },
            [22210] = { "债券型", 10 },
            [22211] = { "收益型", 11 },
            [22212] = { "现金型", 15 },
            [22213] = { "内需增长型", 20 },
            [22214] = { "生命周期型", 21 },
            [22215] = { "综合型", 99 },
        },
    },

    [22301] = {
        key = "聚源-基金运行方式",
        field = "Type",
        types = {
            [22301] = { "契约型封闭式", 1 },
            [22302] = { "开放式", 2 },
            [22303] = { "LOF", 3 },
            [22304] = { "ETF", 4 },
            [22305] = { "FOF", 5 },
            [22306] = { "创新型封闭式", 6 },
            [22307] = { "开放式(带固定封闭期)", 7 },
            [22308] = { "ETF联接基金", 8 },
            [22309] = { "半开放式", 9 },       
        },
    },
    
    [22401] = {
        key = "聚源-基金风险评价",
        field = "riskGrade",
        types = {
            [22401] = { "风险评价为低", 3 },
            [22402] = { "风险评价为较低", 7 },
            [22403] = { "风险评价为中", 10 },
            [22404] = { "风险评价为较高", 15 },
            [22405] = { "风险评价为高", 20 },
            [22406] = { "无风险评价", 99 },
        },
    },

    [22501] = {
        key = "聚源-基金星级",
        field = "starRank",
        types = {
            [22501] = { "星级为一星", 1 },
            [22502] = { "星级为二星", 2 },
            [22503] = { "星级为三星", 3 },
            [22504] = { "星级为四星", 4 },
            [22505] = { "星级为五星", 5 },
            [22506] = { "星级为六星", 6 },
            [22507] = { "无星级评价", 99 },
        },
    },

    [22601] = {
        key = "聚源-指数型基金",
        field = "isHSIndex300",
        types = {
            [22601] = { "沪深300指数基金", 1 },
        },
    },

    [22701] = {
        key = "聚源-债券评级机构",
        field = "insitution",
        types = {
            [22701] = { "中诚信国际信用评级有限责任公司", "中诚信国际信用评级有限责任公司" },
            [22702] = { "大公国际资信评估有限公司", "大公国际资信评估有限公司" },
            [22703] = { "联合资信评估有限公司", "联合资信评估有限公司" },
            [22704] = { "东方金诚国际信用评估有限公司", "东方金诚国际信用评估有限公司" },
            [22705] = { "上海新世纪资信评估投资服务有限公司", "上海新世纪资信评估投资服务有限公司" },
            [22706] = { "鹏元资信评估有限公司", "鹏元资信评估有限公司" },
            [22707] = { "福建省资信评级委员会", "福建省资信评级委员会" },
            [22708] = { "云南省资信评估事务所", "云南省资信评估事务所" },
            [22709] = { "中债资信评估有限责任公司", "中债资信评估有限责任公司" },
            [22710] = { "中国诚信信用管理有限公司", "中国诚信信用管理有限公司" },
            [22711] = { "惠誉国际信用评级有限公司", "惠誉国际信用评级有限公司"},
            [22712] = { "上海远东资信评估有限公司", "上海远东资信评估有限公司"},
            [22713] = { "标准普尔评级公司", "标准普尔评级公司"},
            [22714] = { "联合信用评级有限公司" , "联合信用评级有限公司"},
            [22715] = { "穆迪评级公司", "穆迪评级公司"},
            [22716] = { "中诚信证券评估有限公司", "中诚信证券评估有限公司"},
        },
    },

    [22801] = {
        key = "聚源-是否可赎回",
        field = "isRedeem",
        types = {
            [22801] = { "不可赎回", "不可赎回"},
            [22802] = { "在赎回封闭期", "在赎回封闭期"},
            [22803] = { "不在赎回封闭期", "不在赎回封闭期"},
        },
    },
}

function getLuaCategoryForJuyuan()
    local categories = {}
    for index, subTable in pairs(juyuan_lua_categories) do
        local typesTable = subTable["types"]
        for id, desc in pairs(typesTable) do
            table.insert(categories, id)
        end
    end
    return categories
end

function getLuaCategoryInfoForJuyuan(category_id)
    local index = category_id - (category_id % 100) + 1
    local subTable = juyuan_lua_categories[index]
    if subTable then
        local key = subTable["key"]
        local typesTable = subTable["types"]
        if key and typesTable and typesTable[category_id] then
            key = key .. ":" .. typesTable[category_id][1]
            return { category_id, key, 0 }
        end
    end
    return { category_id, "", 0 }
end

--这个函数设计由于访问数据库过于频繁，要弃用，还是恢复使用以前那一个构建categoryID->stockCode的全局表进行判断
function isStockInJuyuanCategory(con, market, code, category_id)
    local index = category_id - (category_id % 100) + 1
    local subTable = juyuan_lua_categories[index]
    -- rcprintDebugLog(string.format("isStockInJuyuanCategory:  market=%s, code=%s, category_id=%s, index=%s", tostring(market), tostring(code), tostring(category_id), tostring(index)))
    if subTable then
        local fieldName = subTable["field"]
        local typesTable = subTable["types"]
        if fieldName and typesTable and typesTable[category_id] then
            local strQuery = string.format("SELECT %s FROM account_metadata_juyuan where stockMarket = '%s' and stockCode = '%s'", subTable["field"], market, code)
            con:execute[[set names utf8]]
            local cur = con:execute(strQuery)
            if cur:numrows() > 0 then
                local row = cur:fetch({}, "n")
                local v = tonumber(row[1])
                return v == typesTable[category_id][2]
            end
        end
    end
    return false
end

function isStockInMetadataJuyuanTable(metadataJuyuan, market, code, category_id)
    local index = category_id - (category_id % 100) + 1
    local subTable = juyuan_lua_categories[index]
    -- rcprintDebugLog(string.format("isStockInMetadataJuyuanTable:  market=%s, code=%s, category_id=%s, index=%s", tostring(market), tostring(code), tostring(category_id), tostring(index)))
    if subTable then
        local fieldName = subTable["field"]
        local typesTable = subTable["types"]
        if fieldName and metadataJuyuan and metadataJuyuan[code] and metadataJuyuan[code][fieldName] and typesTable and typesTable[category_id] then
            local v = metadataJuyuan[code][fieldName]
            rcprintDebugLog(string.format("isStockInMetadataJuyuanTable: v = %s, typesTable[category_id][2] = %s", tostring(v), tostring(typesTable[category_id][2])))
            if tostring(v) == tostring(typesTable[category_id][2]) then
                rcprintDebugLog(string.format("isStockInMetaJuyuanTable: %s belongs to %s", tostring(code), tostring(category_id)))
            end
            return tostring(v) == tostring(typesTable[category_id][2])
        end
    end
    return false
end

function initIssueDataJuyuan(mysql_conf, isSys)
    local issueData = {}
    local issueId2Name = {}
    local secuCode
    local issueId
    local issueName
    local con = getCon(mysql_conf)
    if nil == con then
        return issueData 
    end
    local strQuery = string.format("select stockMarket, stockCode, issueID, issueName from account_metadata_juyuan where is_sys = %d;",isSys)
    con:execute[[set names utf8]]
    local cur = con:execute(strQuery)
    print (strQuery)
    if cur ~= nil then
        local rowNum = cur:numrows()
        if rowNum <= 0 then
            con:close()
            return issueData
        end
        for i=1, rowNum, 1 do 
            local row = cur:fetch({}, "n")
            if row[1] ~= nil and row[2] ~= nil then
                secuCode = tostring(row[1]) .. tostring(row[2])   --market + code
                if row[3] ~= nil then
                    issueId = tostring(row[3])
                else
                    issueId = "null"
                end
                if row[4] ~= nil then
                    issueName = tostring(row[4])
                else
                    issueName = "null"
                end
                if secuCode and not issueData[secuCode] then
                    issueData[secuCode] = {}
                end
                issueData[secuCode]["issueID"] = issueId
                issueData[secuCode]["issueName"] = issueName
                issueId2Name[issueId] = issueName
                
                --print(string.format("issuerId: %s, issuerName: %s", issueId, issueName))
            end
        end
        cur:close()
    end
    con:close()
    issueData["juyuan_issueId2Name"] = issueId2Name
    return issueData
end
