dofile('../luaScripts/risk/RCUtils.lua')

local function getCon(mysql_conf)
    local res = string.gmatch(mysql_conf, "([^,]+),")
    local ip = res()
    local port = tonumber(res())
    local db = res()
    local user = res()
    local passwd = res()
    local driver = require "luasql.mysql"
    local env = driver.mysql()
    local con = env:connect(db, user, passwd, ip, port)
    return con
end

--[[
caihui_lua_categories = {
    --在LUA中扩展的第三方导入的证券期货分类
    --数据源1: 财汇数据
        --财会数据分类, 根据债券评级的信用级别,初步划定范围为: 证券：20001~20500， 期货: 20501~21000
    20001,          --AAA(信用评级为AAA的债券)  --> 1(数据库表中存储的grade字段值)
    20002,          --AAA- --> 2
    20003,          --AA+  --> 3
    20004,          --AA   --> 4
    20005,          --AA-  --> 5
    20006,          --A+   --> 6
    20007,          --A    --> 7
    20008,          --A-   --> 8
    20009,          --BBB+ --> 9
    20010,          --BBB  --> A
    20011,          --BBB- --> B
    20012,          --BB+  --> C
    20013,          --BB   --> D
    20014,          --BB-  --> E
    20015,          --B+   --> F
    20016,          --B    --> G
    20017,          --B-   --> H
    20018,          --CCC  --> I
    20019,          --CC   --> J
    20020,          --D    --> K
    20021,          --A-1+ --> L
    20022,          --A-1  --> M
    20023,          --A-1- --> N
    20024,          --A-2  --> O
    20025,          --A-3  --> P
    20026           --C    --> Q

       --财会期货分类: 20501~21000
}
]]--

caihui_lua_categories = {
    --[20001] = {
    --    key = "长安财汇-债券评级",
    --    field = "todo",
    --    types = {
    --        [20001] = { "AAA+", '1' },
    --        [20002] = { "AAA-", '2' },
    --        [20003] = { "AA+", '3' },
    --        [20004] = { "AA", '4' },
    --        [20005] = { "AA-", '5' },
    --        [20006] = { "A+", '6' },
    --        [20007] = { "A", '7' },
    --        [20008] = { "A-", '8' },
    --        [20009] = { "BBB+", '9' },
    --        [20010] = { "BBB", 'A' },
    --        [20011] = { "BBB-", 'B' },
    --        [20012] = { "BB+", 'C' },
    --        [20013] = { "BB", 'D' },
    --        [20014] = { "BB-", 'E' },
    --        [20015] = { "B+", 'F' },
    --        [20016] = { "B", 'G' },
    --        [20017] = { "B-", 'H' },
    --        [20018] = { "CCC", 'I' },
    --        [20019] = { "CC", 'J' },
    --        [20020] = { "D", 'K' },
    --        [20021] = { "A-1+", 'L' },
    --        [20022] = { "A-1", 'M' },
    --        [20023] = { "A-1-", 'N' },
    --        [20024] = { "A-2", 'O' },
    --        [20025] = { "A-3", 'P' },
    --        [20026] = { "C", 'Q' },
    --    },
    --},

    [20101] = {
        key = "财汇-债券评级",
        field = "CreditRank",
        types = {
            [20101] = { "AAA", "AAA" },
            [20102] = { "AAA-", "AAA-" },
            [20103] = { "AA+", "AA+" },
            [20104] = { "AA", "AA" },
            [20105] = { "AA-", "AA-" },
            [20106] = { "A+", "A+" },
            [20107] = { "A", "A" },
            [20108] = { "A-", "A-" },
            [20109] = { "BBB+", "BBB+" },
            [20110] = { "BBB", "BBB" },
            [20111] = { "BBB-", "BBB-" },
            [20112] = { "BB+", "BB+" },
            [20113] = { "BB", "BB" },
            [20114] = { "BB-", "BB-" },
            [20115] = { "B+", "B+" },
            [20116] = { "B", "B" },
            [20117] = { "B-", "B-" },
            [20118] = { "CCC", "CCC" },
            [20119] = { "CC", "CC" },
            [20120] = { "D", "D" },
            [20121] = { "A-1+", "A-1+" },
            [20122] = { "A-1", "A-1" },
            [20123] = { "A-1-", "A-1-" },
            [20124] = { "A-2", "A-2" },
            [20125] = { "A-3", "A-3" },
            [20126] = { "C", "C" },
        },
    },

    [20201] = {
        key = "财汇-债券久期",
        field = "duration_mod",
        types = {
            [20201] = { "1年以下", "<=1" },
            [20202] = { "2年以下", "<=2" },
            [20203] = { "3年以下", "<=3" },
            [20204] = { "4年以下", "<=4" },
            [20205] = { "5年以下", "<=5" },
            [20206] = { "5年以上", ">=5" },
        },
    },

    [20301] = {
        key = "财汇-债券类型",
        field = "bondType1",
        types = {
            [20301] = { "信贷资产证券化", "ABS" },
            [20302] = { "券商专项资产管理", "BBS" },
            [20303] = { "可转换债", "BDC" },
            [20304] = { "普通企业债", "BDE" },
            [20305] = { "金融债", "BDF" },
            [20306] = { "地方政府债", "BDL" },
            [20307] = { "国债", "BDT" },
            [20308] = { "央行票据", "CBB" },
            [20309] = { "国际开发机构债券", "IIB" },
            [20310] = { "汽车抵押贷款证券化", "LBS" },
            [20311] = { "住房抵押贷款证券化", "MBS" },
            [20312] = { "同业存单", "NCD" },
            [20313] = { "超短期融资券", "SCP" },
            [20314] = { "住房抵押贷款证券化", "UST" },
        },
    },

    [20401] = {
        key = "财汇-基金风格",
        field = "fundStyle",
        types = {
            [20401] = { "偏股型基金", "偏股型基金" },
            [20402] = { "固定收益类基金", "货币型+债券型" },
            [20403] = { "货币型基金", "货币型基金" },
            [20404] = { "股债平衡型基金", "股债平衡型基金" },
            [20405] = { "债券型基金", "债券型基金" },
            [20406] = { "保本增值", "保本增值" },
        },
    },

    [20501] = {
        key = "财汇-基金类型",
        field = "fundType",
        types = {
            [20501] = { "契约型", "契约型" },
            [20502] = { "公司型", "公司型" },
        },
    },

    [20601] = {
        key = "财汇-基金性质",
        field = "fundNature",
        types = {
            [20601] = { "其它", "其它" },
            [20602] = { "证券投资基金", "证券投资基金" },
            [20603] = { "ETF", "ETF" },
            [20604] = { "FOF", "FOF" },
            [20605] = { "LOF", "LOF" },
            [20606] = { "联接基金", "联接基金" },
        },
    },

    [20701] = {
        key = "财汇-基金投资风格",
        field = "investStyle",
        types = {
            [20701] = { "积极成长型", "积极成长型" },
            [20702] = { "增值型", "增值型" },
            [20703] = { "成长型", "成长型" },
            [20704] = { "价值投资型", "价值投资型" },
            [20705] = { "价值优化型", "价值优化型" },
            [20706] = { "其它", "其它" },
            [20707] = { "分红型", "分红型" },
            [20708] = { "中小企业成长型", "中小企业成长型" },
            [20709] = { "稳健成长型", "稳健成长型" },
            [20710] = { "平衡型", "平衡型" },
            [20711] = { "资产重组型", "资产重组型" },
            [20712] = { "科技型", "科技型" },
            [20713] = { "指数型", "指数型" },
            [20714] = { "优化指数型", "优化指数型" },
            [20715] = { "收益型", "收益型" },
        },
    },

    [20801] = {
        key = "财汇-证券类型",
        field = "SecuType",
        types = {
            [20801] = { "资产支持票据", "ABN"},
            [20802] = { "信贷资产证券化", "ABS" },
            [20803] = { "券商专项资产管理", "BBS" },
            [20804] = { "债转股", "BCE" },
            [20805] = { "债券", "BDO" },
            [20806] = { "可转换债", "BDC" },
            [20807] = { "普通企业债", "BDE" },
            [20808] = { "金融债", "BDF" },
            [20809] = { "地方政府债券", "BDL" },
            [20810] = { "国债", "BDT" },
            [20811] = { "分离式可转债", "BDW" },
            [20812] = { "可交换公司债券", "BEB" },
            [20813] = { "基准利率", "BMR" },
            [20814] = { "深证指数", "BNZ" },
            [20815] = { "银行同业拆放利率", "BOR" },
            [20816] = { "央行票据", "CBB" },
            [20817] = { "牛熊证", "CBC" },
            [20818] = { "集合理财产品", "CIP" },
            [20819] = { "商品", "CMI" },
            --[20820] = { "美圆指数", "DOL" },
            --[20821] = { "股票", "EQO" },
            [20822] = { "A股", "EQA" },
            [20823] = { "B股", "EQB" },
            [20824] = { "H股", "EQH" },
            [20825] = { "N股", "EQN" },
            [20826] = { "S股", "EQS" },
            [20827] = { "交易所基金", "ETF" },
            [20828] = { "基金", "FDO" },
            [20829] = { "封闭式基金", "FDC" },
            [20830] = { "开放式基金", "FDO" },
            [20831] = { "基金系列", "FDS" },
            [20832] = { "外汇", "FRX" },
            [20833] = { "期货", "FTR" },
            [20834] = { "远期合约", "FWD" },
            [20835] = { "黄金期货", "GFT" },
            [20836] = { "黄金ETF", "GLD" },
            [20837] = { "黄金利率", "GOR" },
            [20838] = { "黄金现货", "GST" },
            [20839] = { "港股", "HKE" },
            [20840] = { "拆借", "IBO" },
            [20841] = { "国际开发机构债券", "IIB" },
            [20842] = { "指数", "INO" },
            [20843] = { "上证指数", "INA" },
            [20844] = { "中银指数", "INB" },
            --[20845] = { "恒生指数", "INC" },
            [20846] = { "同业中心指数", "IND" },
            --[[
            [20847] = { "台湾加权指数", "INE" },
            [20848] = { "东经日经指数", "INF" },
            [20849] = { "道琼斯指数", "ING" },
            [20850] = { "NASDAQ指数", "INH" },
            [20851] = { "FTSE100指数", "INI" },
            [20852] = { "法兰克福指数", "INJ" },
            [20853] = { "法国CAC-40指数", "INK" },
            [20854] = { "新华富时指数", "INL" },
            [20855] = { "MSCI指数", "INM" },
            --]]
            [20856] = { "中信指数", "INX" },
            [20857] = { "汽车抵押贷款证券化", "LBS" },
            [20858] = { "上市型基金", "LOF" },
            [20859] = { "住房抵押贷款证券化", "MBS" },
            [20860] = { "权利", "NTW" },
            [20861] = { "原油", "OIL" },
            [20862] = { "基础汇率", "RAB" },
            [20863] = { "交叉汇率", "RAC" },
            [20864] = { "人民币汇率", "RAR" },
            [20865] = { "回购", "RPO" },
            [20866] = { "三板A股", "SBA" },
            [20867] = { "三板B股", "SBB" },
            [20868] = { "标准券", "SCB" },
            [20869] = { "超短期融资券", "SCP" },
            [20870] = { "短期融资券", "SFB" },
            [20871] = { "白银ETF", "SLV" },
            [20872] = { "次级定期债券", "STD" },
            --[[
            [20873] = { "台股", "TPE" },
            [20874] = { "美股", "USS" },
            [20875] = { "美国证券交易计划", "UST" },
            --]]
            [20876] = { "单位信托基金", "UTF" },
            [20877] = { "权证", "WRT" },
        },
    },

    [20901] = {
        key = "财汇-权证类型",
        field = "warType1",
        types = {
            [20901] = { "认购权利", "A" },
            [20902] = { "认沽权利", "B" },
            [20903] = { "认购权证", "C" },
            [20904] = { "认沽权证", "P" },
        },
    },

    [30001] = {
        key = "财汇-权证类型(按发行人划分)",
        field = "warType2",
        types = {
            [30001] = { "股本权证", "A" },
            [30002] = { "备况权证", "B" },
        },
    },

    [30101] = {
        key = "财汇-权证行权方式",
        field = "warRightType",
        types = {
            [30101] = { "美式", "A" },
            [30102] = { "欧式", "B" },
            [30103] = { "百慕大式", "C" },
        },
    },

    [30201] = {
        key = "财汇-权证结算方式",
        field = "warCountType",
        types = {
            [30201] = { "现金结算方式", "C" },
            [30202] = { "实物结算方式", "D" },
            [30203] = { "证券给付结算方式", "S" },
        },
    },

    [30301] = {
        key = "财汇-权证标的证券类型",
        field = "warSecuType",
        types = {
            [30301] = { "债券", "BDO" },
            [30302] = { "可转换债", "BDC" },
            [30303] = { "普通企业债", "BDE" },
            [30304] = { "金融债", "BDF" },
            [30305] = { "国债", "BDT" },
            [30306] = { "深证指数", "BNZ" },
            [30307] = { "股票", "EQO" },
            [30308] = { "A股", "EQA" },
            [30309] = { "B股", "EQB" },
            [30310] = { "基金", "FDO" },
            [30311] = { "指数", "INO" },
            [30312] = { "上证指数", "INA" },
        },
    },

    [30401] = {
        key = "财汇-债券形态",
        field = "bondStatus",
        types = {
            [30401] = { "凭证", "凭证" },
            [30402] = { "记帐", "记帐" },
            [30403] = { "无记名", "无记名" },
            [30404] = { "挂失", "挂失" },
            [30405] = { "实名", "实名" },
            [30406] = { "质押", "质押" },
            [30407] = { "转让", "转让" },
            [30408] = { "电子", "电子" },
        },
    },

    [30501] = {
        key = "财汇-债券品种类别",
        field = "bondProduct",
        types = {
            [30501] = { "贴现债券", "贴现债券" },
            [30502] = { "零息债", "零息债" },
            [30503] = { "付息债券", "付息债券" },
        },
    },

    [30601] = {
        key = "财汇-回购债券类型",
        field = "repType",
        types = {
            [30601] = { "信贷资产证券化", "ABS" },
            [30602] = { "债券", "BDO" },
            [30603] = { "可转换债", "BDC" },
            [30604] = { "普通企业债", "BDE" },
            [30605] = { "金融债", "BDF" },
            [30606] = { "地方政府债券", "BDL" },
            [30607] = { "国债", "BDT" },
            [30608] = { "分离式可转债", "BDW" },
            [30609] = { "可交换公司债券", "BEB" },
            [30610] = { "深证指数", "BNZ" },
            [30611] = { "银行同业拆放利率", "BOR" },
            [30612] = { "商品", "CMI" },
            [30613] = { "美圆指数", "DOL" },
            [30614] = { "股票", "EQ0" },
            [30615] = { "A股", "EQA" },
            [30616] = { "B股", "EQB" },
            [30617] = { "H股", "EQH" },
            [30618] = { "N股", "EQN" },
            [30619] = { "S股", "EQS" },
            [30620] = { "基金", "FD0" },
            [30621] = { "封闭式基金", "FDC" },
            [30622] = { "开放式基金", "FDO" },
            [30623] = { "外汇", "FRX" },
            [30624] = { "期货", "FTR" },
            [30625] = { "黄金期货", "GFT" },
            [30626] = { "黄金ETF", "GLD" },
            [30627] = { "黄金利率", "GOR" },
            [30628] = { "黄金现货", "GST" },
            [30629] = { "拆借", "IBO" },
            [30630] = { "指数", "INO" },
            [30631] = { "上证指数", "INA" },
            [30632] = { "中银指数", "INB" },
            [30633] = { "恒生指数", "INC" },
            [30634] = { "同业中心指数", "IND" },
            --[[
            [30635] = { "台湾加权指数", "INE" },
            [30636] = { "东经日经指数", "INF" },
            [30637] = { "道琼斯指数", "ING" },
            [30638] = { "NASDAQ指数", "INH" },
            [30639] = { "FTSE100指数", "INI" },
            [30640] = { "法兰克福指数", "INJ" },
            [30641] = { "法国CAC-40指数", "INK" },
            [30642] = { "新华富时指数", "INL" },
            ]]--
            [30643] = { "中信指数", "INX" },
            [30644] = { "汽车抵押贷款证券化", "LBS" },
            [30645] = { "住房抵押贷款证券化", "MBS" },
            [30646] = { "原油", "OIL" },
            [30647] = { "基础汇率", "RAB" },
            [30648] = { "交叉汇率", "RAC" },
            [30649] = { "人民币汇率", "RAR" },
            [30650] = { "回购", "RPO" },
            [30651] = { "三板A股", "SBA" },
            [30652] = { "三板B股", "SBB" },
            [30653] = { "标准券", "SCB" },
            [30654] = { "超短期融资券", "SCP" },
            --[30655] = { "美国证券交易试验计划", "UST" },
            [30656] = { "单位信托基金", "UTF" },
            [30657] = { "权证", "WRT" },
        },
    },

    [30701] = {
        key = "财汇-回购方式",
        field = "repstyle",
        types = {
            [30701] = { "买断式", "01" },
            [30702] = { "质押式", "02" },
        },
    },
}

function getLuaCategoryForCaihui()
    local categories = {}
    for index, subTable in pairs(caihui_lua_categories) do
        local typesTable = subTable["types"]
        for id, desc in pairs(typesTable) do
            table.insert(categories, id)
        end
    end
    return categories
end

function getLuaCategoryInfoForCaihui(category_id)
    local index = category_id - (category_id % 100) + 1
    local subTable = caihui_lua_categories[index]
    if subTable then
        local key = subTable["key"]
        local typesTable = subTable["types"]
        if key and typesTable and typesTable[category_id] then
            key = key .. ":" .. typesTable[category_id][1]
            return { category_id, key, 0 }
        end
    end
    return { category_id, "", 0 }
end

function isStockInMetadataCaihuiTable(metadataCaihui, market, code, category_id)
    local index = category_id - (category_id % 100) + 1
    local subTable = caihui_lua_categories[index]
    -- rcprintDebugLog(string.format("isStockInMetadataCaihuiTable:  market=%s, code=%s, category_id=%s, index=%s", tostring(market), tostring(code), tostring(category_id), tostring(index)))
    if subTable then
        local fieldName = subTable["field"]
        local typesTable = subTable["types"]
        if fieldName and metadataCaihui and metadataCaihui[code] and metadataCaihui[code][fieldName] and typesTable and typesTable[category_id] then
            local v = metadataCaihui[code][fieldName]
            -- rcprintDebugLog(string.format("isStockInMetadataCaihuiTable: v = %s, typesTable[category_id][2] = %s", tostring(v), tostring(typesTable[category_id][2])))
            if filedName == "duration_mod" then   --债券久期范围需要特殊处理，不要直接相等
                -- rcprintDebugLog(string.format("isStockInMetadataCaihuiTable: duration_mod=%s", tostring(v)))
                return (tonumber(v) <= tonumber(typesTable[category_id][2]) and tonumber(v) >= 0)
            elseif tostring(v) == tostring(typesTable[category_id][2]) then
                -- rcprintDebugLog(string.format("isStockInMetadataCaihuiTable: %s belongs to %s", tostring(code), tostring(category_id)))
            end
            return tostring(v) == tostring(typesTable[category_id][2])
        end
    end
    return false
end

