dofile('../luaScripts/risk/RCUtils.lua')

custom_lua_categories = {
    --在LUA中扩展的用户自定义的证券期货分类
    --自定义的证券分类: 10001~11000
    10001,          --新上市10日内的股票
    10002,          --
    10003,          -- 
    10004,          --   
    10005,          --  
    10006,          --  
    10007,          --    
    10008,          --   
    10009,          -- 
    10010,          --  
    10011,          -- 
    10012,          --  
    10013,          --   
    10014,          --  
    10015,          --   
    10016,          --    
    10017,          --   
    10018,          --  
    10019,          --   
    10020,          --    
    10021,          -- 
    10022,          --  
    10023,          -- 
    10024,          --  
    10025,          --  
    10026,
    11001,          --30天之内到期的期货合约
    11002,          --
    11003,          --
    11004,          --
    11005,          --
    11006,          --
    11007,          --
    11008,          --
}

function getLuaCategoryForCustom()
    return  custom_lua_categories
end



